Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawLineSegment Method (Point, Point, Color)
 Draws a temporary line segment in the currently active rendered view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawLineSegment(
	Point Point1,
	Point Point2,
	Color Color
)
Public Function DrawLineSegment (
	Point1 As Point,
	Point2 As Point,
	Color As Color
) As Boolean
Parameters
Point1
Type: Tekla.Structures.Geometry3d.Point
The first point of the line.
Point2
Type: Tekla.Structures.Geometry3d.Point
The second point of the line.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the line. The transparency value of the color is ignored.
Return Value
Type: Boolean
True on success.
See Also
Reference
GraphicsDrawer Class
DrawLineSegment Overload
Tekla.Structures.Model.UI Namespace